# MIT License
#
# Copyright (c) 2023 AnonymousX1025
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

from FallenMusic import BOT_NAME

PM_START_TEXT = """
آهہ‏‏لآ! {0}

🎧━━⊶🎙•ᥴᖇ ᥉᥆υᖇᥴᥱ•🎙⊷━━🎧

🔺️║مرحبا بك عزيزي ↤「المستخدم」- ◍

🔻║آنا بوت اختصاصي تشغيل الموسيقي والفيديو - ◍

🔺️║البوت يدعم القنوآت والمجموعآت - ◍

🔻║أدعم آيضا اللغات المتعدده للأستخدام - ◍

🔺️║أدعم آيضا بعض المميزآت الأضافيه - ◍

🔻║أكتشف آوامر التشغيل من خلال زر -( المساعدة ) - ◍

🎧━━⊶🎙•ᥴᖇ ᥉᥆υᖇᥴᥱ•🎙⊷━━🎧
"""

START_TEXT = """
آهہ‏‏لآ! {0}

🎧━━⊶🎙•ᥴᖇ ᥉᥆υᖇᥴᥱ•🎙⊷━━🎧

🔺️║مرحبا بك عزيزي ↤「المستخدم」- ◍

🔻║آنا بوت اختصاصي تشغيل الموسيقي والفيديو - ◍

🔺️║البوت يدعم القنوآت والمجموعآت - ◍

🔻║أدعم آيضا اللغات المتعدده للأستخدام - ◍

🔺️║أدعم آيضا بعض المميزآت الأضافيه - ◍

🔻║أكتشف آوامر التشغيل من خلال زر -( المساعدة ) - ◍

🎧━━⊶🎙•ᥴᖇ ᥉᥆υᖇᥴᥱ•🎙⊷━━🎧
"""

HELP_TEXT = f"""
<u>❄ **🥇الاوامر في بوت سورس كرستين🥇 {BOT_NAME} :**</u>

๏ /شغل : لتشغيل اغاني في الكول
๏ /وقف : عشان توقف الاغنية موقتا
๏ /كمل : عشان تكمل الاغنية
๏ /تخطي : لعمل تخطي لاغنية
๏ /وقف : لايقاف الاغاني 

๏ /بنك : لمعرفت سرعه البوت
๏ /المطورين : لمعرفة مطورين البوت

๏ /تحميل : لتحمـيـل مـن اليوتيوب 

๏ /بحث : لليحث في اليوتيوب 
"""

HELP_SUDO = f"""
<u>✨ **🍿اوامر المطورين🍑 {BOT_NAME} :**</u>

๏ /المكالمات : لمـعرفت آلمـگآلمـآت آلسـآريـهہ‏‏ 
๏ /eval or /sh : لآضـآف‏‏هہ آمـر بآلبوت
๏ /فحص : لفحصـ آلبوت
๏ /الاحصائيات : لمـعرفت آحصـآئيـآت آلبوت

๏ /اسم [قمـ بگتب آلآسـمـ آو عمـل ريـﮯب عليـﮯهہ‏‏] : لتغيـر آسـمـ آلحسـآب آلمـسـآعد
๏ /بايو [قمـ بگتب آلبآيـﮯو آو عمـل ريـﮯب عليـﮯهہ] : لتغيـر بآيـﮯو آلحسـآب آلمـسـآعد
๏ /صورة [ريـﮯب عليـﮯ صـور‏‏هہ] : لتغيـﮯر صـور‏‏هہ آلحسـآب آلمـسـآعد
๏ /مسح : لحذف صـور‏‏هہ آلحسـآب
"""

HELP_DEV = f"""
<u>✨ **اوامر المالك {BOT_NAME} :**</u>

๏ /الفارات : لمعرفه فارات البوا
๏ /اذاعة [الرساله او ريب علي الرساله] : عشان تعمل باذاعه يحب
๏ /تنظيف : لحذف جميع سجلات البوت
๏ /مغادرة : عشان المساعد يغادر من كل البارات

๏ /مطور [يوزر او ريب علي الشخص] : لضافه مطور في البوت 
๏ /تك [يوزر او ريب علي شخص] : لتنزيله من قايمه المطورين
"""
